#############################
# VALIDATION MESSAGES
#############################

invalid.not-positive.id=\u0417\u043D\u0430\u0447\u0435\u043D\u043D\u044F ID \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043F\u043E\u0437\u0438\u0442\u0438\u0432\u043D\u0438\u043C
invalid.not-empty=${validatedValue} \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043D\u0435 \u043F\u0443\u0441\u0442\u0438\u043C
invalid.not-null=${validatedValue} \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043D\u0435 null
invalid.size=${validatedValue} \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043C\u0456\u0436 {min} \u0442\u0430 {max} \u043A\u0456\u043B\u044C\u043A\u0456\u0441\u0442\u044E \u0441\u0438\u043C\u0432\u043E\u043B\u0456\u0432
invalid.max-size=${validatedValue} \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043C\u0435\u043D\u0448\u0435 \u043D\u0456\u0436 {max} \u0441\u0438\u043C\u0432\u043E\u043B\u0456\u0432
invalid.email=\u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u0432\u0432\u0435\u0434\u0456\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u0443 \u0435\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0443 \u043F\u043E\u0448\u0442\u0443 (\u041D\u0430\u043F\u0440\u0438\u043A\u043B\u0430\u0434: username@example.com)
invalid.username=\u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u0432\u0432\u0435\u0434\u0456\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u0438\u0439 \u043B\u043E\u0433\u0456\u043D (\u043D\u0435 \u0432\u0438\u043A\u043E\u0440\u0438\u0441\u0442\u043E\u0432\u0443\u0439\u0442\u0435 \u043F\u0440\u043E\u0431\u0456\u043B\u0438)
invalid.past-or-present.date=${validatedValue} \u0434\u0430\u0442\u0430 \u043D\u0435 \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u0432 \u043C\u0430\u0439\u0431\u0443\u0442\u043D\u044C\u043E\u043C\u0443
invalid.password=\u0412\u0430\u0448 \u043F\u0430\u0440\u043E\u043B\u044C \u043F\u043E\u0432\u0438\u043D\u0435\u043D \u043C\u0430\u0442\u0438 \u044F\u043A\u043C\u0435\u043D\u0448 \u043E\u0434\u043D\u0443: \u0432\u0435\u043B\u0438\u043A\u0443 \u043B\u0456\u0442\u0435\u0440\u0443 \u043B\u0430\u0442\u0438\u043D\u0441\u044C\u043A\u043E\u0457 \u0430\u0431\u0435\u0442\u043A\u0438 (A-Z), \u043C\u0430\u043B\u0443 \u043B\u0456\u0442\u0435\u0440\u0443 (a-z) \u0442\u0430 \u0446\u0438\u0444\u0440\u0443 (0-9)
invalid.password.size=\u0414\u043E\u0432\u0436\u0438\u043D\u0430 \u043F\u0430\u0440\u043E\u043B\u044F \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043C\u0456\u0436 {min} \u0442\u0430 {max} \u043A\u0456\u043B\u044C\u043A\u0456\u0441\u0442\u044E \u0441\u0438\u043C\u0432\u043E\u043B\u0456\u0432
incorrect.password=\u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u0432\u0432\u0435\u0434\u0456\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u0438\u0439 \u043F\u0430\u0440\u043E\u043B\u044C
invalid.username.size=\u0414\u043E\u0432\u0436\u0438\u043D\u0430 \u0432\u0430\u0448\u043E\u0433\u043E \u043B\u043E\u0433\u0456\u043D\u0430 \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 {min} \u0442\u0430 {max} \u043A\u0456\u043B\u044C\u043A\u0456\u0441\u0442\u044E \u0441\u0438\u043C\u0432\u043E\u043B\u0456\u0432 (\u043D\u0435 \u0432\u0438\u043A\u043E\u0440\u0438\u0441\u0442\u043E\u0432\u0443\u0439\u0442\u0435 \u043F\u0440\u043E\u0431\u0456\u043B\u0438)
invalid.username-or-password=\u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u043F\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u0456\u0441\u0442\u044C \u0432\u0432\u043E\u0434\u0443 \u043B\u043E\u0433\u0456\u043D\u0443 \u0442\u0430 \u043F\u0430\u0440\u043E\u043B\u044E
invalid.oauth2.login=\u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u0441\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0449\u0435 \u0440\u0430\u0437 \u0430\u0431\u043E \u0432\u0438\u043A\u043E\u0440\u0438\u0441\u0442\u0430\u0439\u0442\u0435 \u0456\u043D\u0448\u0438\u0439 \u0430\u043A\u043A\u0430\u0443\u043D\u0442
invalid.phone.number=\u0422\u0435\u043B\u0435\u0444\u043E\u043D\u043D\u0438\u0439 \u043D\u043E\u043C\u0435\u0440 \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u0432 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u043C\u0443 \u0444\u043E\u0440\u043C\u0430\u0442\u0456 (\u041D\u0430\u043F\u0440\u0438\u043A\u043B\u0430\u0434: +380501234567 \u0447\u0438 +1(234)567-89-10)
invalid.phones-amount=\u041A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043D\u0435 \u043C\u043E\u0436\u0435 \u043C\u0430\u0442\u0438 \u0431\u0456\u043B\u044C\u0448\u0435 \u043D\u0456\u0436 {max} \u0437\u0430\u0440\u0435\u0454\u0441\u0442\u0440\u043E\u0432\u0430\u043D\u0438\u0445 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0456\u0432
invalid.first-or-last.name=${validatedValue} \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043C\u0456\u0436 2 \u0442\u0430 50 \u0441\u0438\u043C\u0432\u043E\u043B\u0430\u043C\u0438 (\u0434\u043E\u0437\u0432\u043E\u043B\u044F\u0454\u0442\u044C\u0441\u044F \u0432\u0438\u043A\u043E\u0440\u0438\u0441\u0442\u0430\u043D\u043D\u044F ['] \u0442\u0430 [-] )
invalid.confirm.email=\u041D\u0435\u0441\u043F\u0456\u0432\u043F\u0430\u0434\u0456\u043D\u043D\u044F \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u0445 \u0456\u043C\u0435\u0439\u043B\u0456\u0432. \u0412\u043F\u0435\u0432\u043D\u0456\u0442\u044C\u0441\u044F, \u0449\u043E \u0432\u043E\u043D\u0438 \u0456\u0434\u0435\u043D\u0442\u0438\u0447\u043D\u0456
username-email.duplicate=\u041A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0456\u0437 \u043F\u043E\u0442\u043E\u0447\u043D\u0438\u043C \u043B\u043E\u0433\u0456\u043D\u043E\u043C \u0447\u0438 \u0456\u043C\u0435\u0439\u043B\u043E\u043C \u0432\u0436\u0435 \u0456\u0441\u043D\u0443\u0454. \u0423\u0432\u0456\u0439\u0434\u0456\u0442\u044C \u0434\u043E \u0441\u0438\u0441\u0442\u0435\u043C\u0438 \u0447\u0438 \u0432\u0432\u0435\u0434\u0456\u0442\u044C \u0456\u043D\u0448\u0456 \u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044F.
email.duplicate=\u041A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u0456\u0437 \u043F\u043E\u0442\u043E\u0447\u043D\u0438\u043C \u0456\u043C\u0435\u0439\u043B\u043E\u043C \u0432\u0436\u0435 \u0456\u0441\u043D\u0443\u0454
exception.email.old=\u0412\u0438 \u0432\u0432\u0435\u043B\u0438 \u0432\u0430\u0448 \u043F\u043E\u0442\u043E\u0447\u043D\u0438\u0439 \u0456\u043C\u0435\u0439\u043B. \u0417\u043C\u0456\u043D\u0456\u0442\u044C \u0439\u043E\u0433\u043E \u043D\u0430 \u043D\u043E\u0432\u0438\u0439 \u0442\u0430 \u043F\u043E\u0432\u0442\u043E\u0440\u0456\u0442\u044C \u0441\u043F\u0440\u043E\u0431\u0443
different.passwords=\u0412\u0430\u0448\u0456 \u043F\u0430\u0440\u043E\u043B\u0456 \u043D\u0435 \u0441\u043F\u0456\u0432\u043F\u0430\u0434\u0430\u044E\u0442\u044C. \u0421\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0449\u0435 \u0440\u0430\u0437
same.passwords=\u041d\u043e\u0432\u0438\u0439\u0020\u043f\u0430\u0440\u043e\u043b\u044c\u0020\u0437\u0431\u0456\u0433\u0430\u0454\u0442\u044c\u0441\u044f\u0020\u0437\u0020\u043f\u043e\u0442\u043e\u0447\u043d\u0438\u043c
user.not-registered=\u041D\u0435\u0432\u0434\u0430\u043B\u0430 \u0441\u043F\u0440\u043E\u0431\u0430 \u0440\u0435\u0454\u0441\u0442\u0440\u0430\u0446\u0456\u0457 \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430. \u041F\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0432\u0432\u0435\u0434\u0435\u043D\u0456 \u0434\u0430\u043D\u0456
invalid.child.age=\u0412\u0456\u043A \u0434\u0438\u0442\u0438\u043D\u0438 \u043F\u043E\u0432\u0438\u043D\u0435\u043D \u0431\u0443\u0442\u0438 \u043C\u0435\u043D\u0448\u0435 18 \u0440\u043E\u043A\u0456\u0432.

invalid.token=\u0414\u043B\u044F \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0434\u043E \u043F\u043E\u0442\u043E\u0447\u043D\u043E\u0433\u043E \u0440\u0435\u0441\u0443\u0440\u0441\u0430 \u0432\u0438 \u043C\u0430\u0454\u0442\u0435 \u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0443\u0432\u0430\u0442\u0438\u0441\u044F
token.signature.not.valid=\u041F\u0456\u0434\u043F\u0438\u0441 JWT \u0442\u043E\u043A\u0435\u043D\u0443 \u043D\u0435 \u0441\u043F\u0456\u0432\u043F\u0430\u0434\u0430\u0454 \u0432\u0438\u0440\u0430\u0445\u043E\u0432\u0430\u043D\u043E\u043C\u0443. JWT \u0442\u043E\u043A\u0435\u043D \u043C\u043E\u0436\u0435 \u0431\u0443\u0442\u0438 \u0445\u0438\u0431\u043D\u0438\u043C \u0442\u0430 \u043D\u0435 \u043C\u0456\u0441\u0442\u0438\u0442\u044C \u0434\u043E\u0432\u0456\u0440\u0438
access.token.expired=JWT \u0437\u0430\u043A\u0456\u043D\u0447\u0438\u0432 \u0442\u0435\u0440\u043C\u0456\u043D \u0434\u0456\u0457
refresh.token.invalid=Refresh \u0442\u043E\u043A\u0435\u043D \u043D\u0435\u0432\u0430\u043B\u0456\u0434\u043D\u0438\u0439: {0} . \u0412\u0456\u043D \u043D\u0435 \u0456\u0441\u043D\u0443\u0454 \u0432 \u0431\u0430\u0437\u0456 \u0434\u0430\u043D\u043D\u0438\u0445 \u0447\u0438 \u0437\u0430\u043A\u0456\u043D\u0447\u0438\u0432 \u0442\u0435\u0440\u043C\u0456\u043D \u0434\u0456\u0457. \u0411\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u043F\u0435\u0440\u0435\u043B\u043E\u0433\u0456\u043D\u0442\u0435\u0441\u044F, \u0449\u043E\u0431 \u0437\u0433\u0435\u043D\u0435\u0440\u0443\u0432\u0430\u0442\u0438 \u043D\u043E\u0432\u0438\u0439

category.not-deletable=\u041A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u044F \u0456\u0437 \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u043C ID \u043D\u0435 \u043C\u043E\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u0434\u0430\u043B\u0435\u043D\u0430, \u0431\u043E \u043C\u0456\u0441\u0442\u0438\u0442\u044C \u043F\u0456\u0434\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u0457 \u0447\u0438 \u0437\u0432'\u044F\u0437\u0430\u043D\u0456 \u043E\u0433\u043E\u043B\u043E\u0448\u0435\u043D\u043D\u044F. \u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0435 ID:
invalid.new-category-dto=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0430 \u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u044F \u043C\u043E\u0436\u043B\u0438\u0432\u043E \u0456\u0441\u043D\u0443\u0454. \u041F\u0435\u0440\u0435\u0432\u0456\u0440\u0442\u0435 \u0443\u043D\u0456\u043A\u0430\u043B\u044C\u043D\u0456\u0441\u0442\u044C \u0442\u0430 \u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044F \u0443\u0441\u0456\u0445 ID \u043F\u0456\u0434\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u0439 \u0440\u0456\u0432\u043D\u0438\u043C\u0438 \u043D\u0443\u043B\u044E!
invalid.updated-category.dto=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0430 \u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u044F \u043D\u0435 \u0456\u0441\u043D\u0443\u0454, \u0430\u0431\u043E \u043C\u0430\u0454 \u043D\u0435\u043A\u043E\u0440\u0435\u043A\u0442\u043D\u0456 \u0434\u0430\u043D\u0456 \u043F\u0456\u0434\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u0439!
subcategory.not-deletable=\u041F\u0456\u0434\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u044F \u0456\u0437 \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u043C ID \u043D\u0435 \u043C\u043E\u0436\u0435 \u0431\u0443\u0442\u0438 \u0432\u0438\u0434\u0430\u043B\u0435\u043D\u0430, \u0431\u043E \u043C\u0456\u0441\u0442\u0438\u0442\u044C \u0437\u0432'\u044F\u0437\u0430\u043D\u0456 \u043E\u0433\u043E\u043B\u043E\u0448\u0435\u043D\u043D\u044F. \u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0435 ID:

user.not-owner=\u0412\u0438 \u043D\u0435 \u0454 \u0432\u043B\u0430\u0441\u043D\u0438\u043A\u043E\u043C \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u043E\u0433\u043E \u043E\u0433\u043E\u043B\u043E\u0448\u0435\u043D\u043D\u044F:
user.created=\u041D\u043E\u0432\u043E\u0433\u043E \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0443\u0441\u043F\u0456\u0448\u043D\u043E \u0441\u0442\u0432\u043E\u0440\u0435\u043D\u043E
invalid.subcategory.id=\u041F\u0456\u0434\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0456\u044F \u0456\u0437 \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u043C ID \u043D\u0435 \u0456\u0441\u043D\u0443\u0454. ID:
invalid.location.id=\u041B\u043E\u043A\u0430\u0446\u0456\u044F \u0456\u0437 \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u043C ID \u043D\u0435 \u0456\u0441\u043D\u0443\u0454. ID: 
new.location.id.not-zero=ID \u043D\u043E\u0432\u043E\u0457 \u043B\u043E\u043A\u0430\u0446\u0456\u0457 \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u043D\u0443\u043B\u0435\u043C

empty.username=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u043E \u043F\u0443\u0441\u0442\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044F \u0437\u0430\u043C\u0456\u0441\u0442\u044C \u043B\u043E\u0433\u0456\u043D\u0443/\u0456\u043C\u0435\u0439\u043B\u0443
empty.password=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u043E \u043F\u0443\u0441\u0442\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044F \u0437\u0430\u043C\u0456\u0441\u0442\u044C \u043F\u0430\u0440\u043E\u043B\u044E
empty.confirm.password=\u041F\u0430\u0440\u043E\u043B\u044C \u043F\u0456\u0434\u0442\u0432\u0435\u0440\u0434\u0436\u0435\u043D\u043D\u044F \u043F\u0443\u0441\u0442\u0438\u0439
empty.email=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0443 \u043F\u0443\u0441\u0442\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u043D\u044F \u0456\u043C\u0435\u0439\u043B\u0443

## Exception messages
exception.user.not-found=\u041A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043D\u0435 \u0437\u043D\u0430\u0439\u0434\u0435\u043D\u043E
exception.illegal.id=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u043E \u043D\u0435\u0456\u0441\u043D\u0443\u044E\u0447\u0456 ID:
exception.invalid.dto=\u041A\u0456\u043B\u044C\u043A\u0456\u0441\u0442\u044C \u043E\u0442\u0440\u0438\u043C\u0430\u043D\u0438\u0445 \u043E\u0431'\u0454\u043A\u0442\u0456\u0432 \u0454 \u0431\u0456\u043B\u044C\u0448\u043E\u044E \u0447\u0438 \u043C\u0435\u043D\u0448\u043E\u044E \u0437\u0430 \u0432\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0456 \u0440\u0430\u043C\u043A\u0438. \u041C\u0456\u043D\u0456\u043C\u0443\u043C: {min}, \u043C\u0430\u043A\u0441\u0438\u043C\u0443\u043C {max}
exception.illegal.operation=\u041E\u043F\u0435\u0440\u0430\u0446\u0456\u044F \u043D\u0435 \u0434\u043E\u0437\u0432\u043E\u043B\u0435\u043D\u0430
exception.children-amount=\u041A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043D\u0435 \u043C\u043E\u0436\u0435 \u043C\u0430\u0442\u0438 \u0431\u0456\u043B\u044C\u0448\u0435 \u043D\u0456\u0436 {0} \u0437\u0430\u0440\u0435\u0454\u0441\u0442\u0440\u043E\u0432\u0430\u043D\u0438\u0445 \u0434\u0456\u0442\u0435\u0439
exception.exceed.images.number=\u0417\u0430\u0433\u0430\u043B\u044C\u043D\u0430 \u043A\u0456\u043B\u044C\u043A\u0456\u0441\u0442\u044C \u0437\u0431\u0435\u0440\u0435\u0436\u0435\u043D\u0438\u0445 \u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u044C \u043D\u0435 \u043C\u043E\u0436\u0435 \u0431\u0443\u0442\u0438 \u0431\u0456\u043B\u044C\u0448\u043E\u044E \u0437\u0430 {0}
exception.advertisement-image.id.not-found=\u041D\u0435\u0441\u043F\u0456\u0432\u043F\u0430\u0434\u0456\u043D\u043D\u044F ID \u043E\u0433\u043E\u043B\u043E\u0448\u0435\u043D\u043D\u044F \u0442\u0430 \u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u043D\u044F, \u0449\u043E \u043C\u0430\u0454 \u0431\u0443\u0442\u0438 \u0432\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u044F\u043A \u0442\u0438\u0442\u0443\u043B\u044C\u043D\u0435
exception.image.not-existed-id=\u041E\u0442\u0440\u0438\u043C\u0430\u043D\u0456 ID \u043D\u0435\u0456\u0441\u043D\u0443\u044E\u0447\u0438\u0445 \u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u044C: {0}
exception.invalid.locations.file.creating.data=\u041F\u043E\u043C\u0438\u043B\u043A\u0430 \u043F\u0440\u0438 \u043F\u0435\u0440\u0435\u0442\u0432\u043E\u0440\u0435\u043D\u043D\u0456 \u0444\u0430\u0439\u043B\u0443 \u0437 \u043B\u043E\u043A\u0430\u0446\u0456\u044F\u043C\u0438: \u043D\u0435\u0441\u043F\u0456\u0432\u043F\u0430\u0434\u0456\u043D\u043D\u044F \u0444\u043E\u0440\u043C\u0430\u0442\u0443 \u0434\u0430\u043D\u0438\u0445
exception.emailing.registration=\u041F\u0456\u0434\u0447\u0430\u0441 \u0432\u0456\u0434\u043F\u0440\u0430\u0432\u043A\u0438 \u0440\u0435\u0454\u0441\u0442\u0440\u0430\u0446\u0456\u0439\u043D\u043E\u0433\u043E \u0456\u043C\u0435\u0439\u043B\u0443 \u0432\u0438\u043D\u0438\u043A\u043B\u0430 \u043D\u0435\u0441\u043F\u043E\u0434\u0456\u0432\u0430\u043D\u0430 \u043F\u043E\u043C\u0438\u043B\u043A\u0430. \u0421\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0437\u0433\u043E\u0434\u043E\u043C

## Positive messages
changed.user.password=\u041F\u0430\u0440\u043E\u043B\u044C \u0443\u0441\u043F\u0456\u0448\u043D\u043E \u0437\u043C\u0456\u043D\u0435\u043D\u043E
changed.user.email=\u0406\u043C\u0435\u0439\u043B \u0443\u0441\u043F\u0456\u0448\u043D\u043E \u0437\u043C\u0456\u043D\u0435\u043D\u043E
changed.user.info=\u0414\u0430\u043D\u043D\u0456 \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u0443\u0441\u043F\u0456\u0448\u043D\u043E \u0437\u043C\u0456\u043D\u0435\u043D\u043E
account.self.delete.request=\u0412\u0430\u0448 \u0430\u043A\u0430\u0443\u043D\u0442 \u0431\u0443\u0434\u0435 \u0432\u0438\u0434\u0430\u043B\u0435\u043D\u043E \u0437\u0430 {0} \u0434\u0435\u043D\u044C(-\u0456\u0432)! \u0429\u043E\u0431 \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0442\u0438\u0441\u044F \u0443\u0441\u0456\u043C\u0430 \u0444\u0443\u043D\u043A\u0446\u0456\u044F\u043C\u0438 \u0441\u0430\u0439\u0442\u0443, \u0431\u0443\u0434\u044C \u043B\u0430\u0441\u043A\u0430, \u0437\u0440\u043E\u0431\u0456\u0442\u044C \u0439\u043E\u0433\u043E \u0430\u043A\u0442\u0438\u0432\u043D\u0438\u043C
account.made.active.again=\u0410\u043A\u0430\u0443\u043D\u0442 \u0443\u0441\u043F\u0456\u0448\u043D\u043E \u0440\u0435\u0430\u043A\u0442\u0438\u0432\u043E\u0432\u0430\u043D\u043E

## Email messages
registration.header=\u0417\u0430\u043F\u0438\u0442 \u043D\u0430 \u0440\u0435\u0454\u0441\u0442\u0440\u0430\u0446\u0456\u044E \u043D\u043E\u0432\u043E\u0433\u043E \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430
registration.body=\u0412\u0430\u0448 \u0456\u043C\u0435\u0439\u043B \u0431\u0443\u0432 \u0432\u043A\u0430\u0437\u0430\u043D\u0438\u0439 \u0432 \u044F\u043A\u043E\u0441\u0442\u0456 \u043D\u043E\u0432\u043E\u0433\u043E \u043A\u043E\u0440\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0430 \u043D\u0430 \u0441\u0435\u0440\u0432\u0456\u0441\u0456 \u041E\u0431\u043C\u0456\u043D\u044F\u0448\u043A\u0430
