const ru = {
	auth: {
		login: 'Вход',
		signUp: 'Регистрация',
		logEmail: 'Введите ваш E-mail или логин',
		logPassword: 'Введите ваш пароль',
		regEmail: 'Введите ваш E-mail',
		regLogin: 'Введите ваш Логин',
		regPassword: 'Введите ваш пароль',
		regConfirm: 'Повторите пароль',
		remember: 'Запомнить меня',
		noLogin: 'Не можете войти?',
		agreement: '* Я соглашаюсь с правилами использования сервиса, а также с передачей и обработкой моих данных. Я подтверждаю своё совершеннолетие и ответственность за размещение объявлений.'
	},
	errors: {
		logEmail: 'Введите верный логин или email',
		logPassword: 'Неверный пароль',
		regEmail: 'Укажите действующий адрес электронной почты',
		regNick: 'Больше 2 и меньше 50 символов, без пробелов',
		regPassword: 'Большие и малые латинские буквы и цифры. Длина от 8 до 30 символов',
		regConfirm: 'Пароли должны совпадать'
	},
	button: {
		addAdv: 'Добавить объявление',
		enter: 'Войти'
	},
	header: {
		about: 'О проекте',
		goodness: 'Доброе дело',
		myOffice: 'Мой кабинет',
		categories: 'Категории',
		iSearch: 'Я ищу',
		clothes: 'Одежда',
		shoes: 'Обувь',
		toys: 'Игрушки',
		vehicles: 'Транспорт для детей',
		furniture: 'Детская мебель',
		babies: 'Малыши до года',
		books: 'Книги',
		another: 'Другое'
	},
	footer: {
		rules: 'Правила безопасной сделки',
		charity: 'Благотворительные организации',
		questions: 'Часто задаваемые вопросы',
		protect: 'Все права защищены'
	},
	fourOhFour: {
		noPage: 'Страница не существует!',
		mainPage: 'На главную',
		backPage: 'Назад'
	},
	somethingBad: {
		error: 'Ошибка! Что будем делать?',
		mainPage: 'На главную',
		backPage: 'Назад'
	}
};

export default ru;
